Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Select Method (String)
 Selects the shape based on the given name from the database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string name
)
Public Function Select (
	name As String
) As Boolean
Parameters
name
Type: System.String
The name of the shape.
Return Value
Type: Boolean
True on success. False if the shape was not found.
See Also
Reference
ShapeItem Class
Select Overload
Tekla.Structures.Catalogs Namespace